simulation/cornerFlow/cornerFlow_cuda/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)  // 0
    (1 0 0)  // 1
    (1 0.5 0)  // 2
    (1 1 0)  // 3
    (0 1 0)  // 4
    (0 0.5 0)  // 5

    (0 0 1)  // 6
    (1 0 1)  // 7
    (1 0.5 1)  // 8
    (1 1 1)  // 9
    (0 1 1)  // 10
    (0 0.5 1)  // 11
);

blocks
(
    hex (0 1 2 5 6 7 8 11) (500 250 1) simpleGrading (1 1 1)
    hex (5 2 3 4 11 8 9 10) (500 250 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (5 4 10 11)
        );
    }
    obstacle
    {
        type patch;
        faces
        (
            (0 5 11 6)
            (0 1 7 6)
            (4 3 9 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 8 7)
            (2 3 9 8)
        );
    }
);


// ************************************************************************* //
